# Pandas
---
## [목차]
### 1. DataFrame
- 1.1 Create : list, dictionary, index
- 1.2 Insert : row, column
### 2. Search
- 2.1 loc / iloc
- 2.2 series / dataframe : [], [[]] (type)
- 2.3 copy / deepcopy
- 2.4 index로 찾을거냐 / boolean으로 찾을거냐
### 3. Function
- 3.1 apply
- 3.2 lambda
- 3.3 format
- 3.4 append
- 3.5 reset_index : drop, inplace
- 3.6 sort_values : ascending
- 3.7 rank, value_counts, count
### 4. Modify
- 4.1 concat : axis, join_outer/inner
- 4.2 merge (sql_join) : how-outer/inner
- 4.3 groupby : size, sort_values
- 4.4 agg : min, max, mean, sum, median
- 4.5 select : head(), tail(), slicing
- 4.6 describe(), info(), dtypes
- 4.7 unique
- 4.8 rename
### 5. 기타
- 5.1 전치 .T, .transpose()
- 5.2 .isin() : boolean으로 만들고
- 5.3 .any(axis=1) : 해당 축 뽑고
- 5.4 .str.contains('a') : 문자열에 a 있어?
- 5.5 pd.date_range
- 5.6 np.random.randint()

---
### 라이브러리 불러오기
 - **pandas**: 데이터프레임을 다루기 위한 라이브러리
 - **matplotlib.pyplot**: 데이터시각화를 위한 라이브러리
 - **seaborn**: 데이터시각화를 위한 라이브러리
 - **numpy**: 고성능 수치연산을 위한 라이브러리

In [1]:
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns
import numpy as np

## 1. Pandas 복습
---

### 1.1 create

데이터 프레임에 컬럼 이름을 설정하여 새로 생성합니다.

In [223]:
df = pd.DataFrame(columns=["Email", "Name"])
df

Empty DataFrame
Columns: [Email, Name]
Index: []

In [471]:
df['Name'] = ["doori", "minsu"]

ValueError: Length of values (2) does not match length of index (6710700)

In [472]:
df

,bearing_1_id,bearing_2_id,timestamp,a1_x,a1_y,a1_z,a2_x,a2_y,a2_z,rpm,hz,w,status
0,0,1,0.000000,0.113269,0.149706,-0.110275,-0.186030,0.194450,0.454299,0.000000,0.000000,0.000006,0
1,0,1,0.000333,-0.367713,-0.228832,0.177821,0.285992,0.002226,-0.043930,0.000000,0.000000,0.000243,0
2,0,1,0.000667,0.113269,0.149706,-0.398371,-0.091625,0.002226,0.454299,0.000000,0.000000,0.000369,0
3,0,1,0.001000,-0.175320,-0.228832,-0.110275,0.285992,0.002226,0.255007,0.000000,0.000000,0.000520,0
4,0,1,0.001333,-0.079124,0.055072,-0.110275,0.191588,0.002226,0.255007,0.000000,0.000000,0.000175,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6710695,0,72,32.098333,-0.367713,0.149706,0.465916,-0.469243,0.194450,0.553945,178.748759,2.979146,0.019412,1
6710696,0,72,32.098667,-0.463909,0.338975,0.561948,-0.469243,0.194450,0.354653,178.748759,2.979146,0.032027,1
6710697,0,72,32.099000,0.017072,0.433610,0.369884,-0.563647,-0.093886,0.155361,178.748759,2.979146,0.012211,1
6710698,0,72,32.099333,0.209465,0.244341,0.273852,-0.374838,0.194450,0.155361,178.748759,2.979146,0.000764,1
6710699,0,72,32.099667,0.498054,0.244341,0.177821,-0.186030,0.290562,-0.243222,178.748759,2.979146,0.002794,1

In [227]:
df = pd.DataFrame(columns=["Email", "Name"])
df["Name"] = ["doori", "minsu"]
df["Email"] = ["dr@gmail.com", "ms@gmail.com"]
print(df)
print(type(df["Name"]))

          Email   Name
0  dr@gmail.com  doori
1  ms@gmail.com  minsu
<class 'pandas.core.series.Series'>

컬럼에 데이터를 삽입합니다.

In [228]:
df["Name"] = ["fcamp", "dss"]
df["Email"] = ["fcamp@gmail.com", "dss@gmail.com"]
df

             Email   Name
0  fcamp@gmail.com  fcamp
1    dss@gmail.com    dss

컬럼데이터를 확인하면 Series 데이터임을 확인할 수 있습니다.

In [229]:
type(df["Name"])

pandas.core.series.Series

In [230]:
df["Email"]

0    fcamp@gmail.com
1      dss@gmail.com
Name: Email, dtype: object

#### 2.1.2 딕셔너리 데이터 타입을 Dataframe으로 만드는 방법

In [231]:
name = ["doori", "minsu"]
email = ["dr@gmail.com", "ms@gmail.com"]
ids = [1, 2]
dic = {"Name":name, "Email":email, "id": ids}
df = pd.DataFrame(dic)
df

    Name         Email  id
0  doori  dr@gmail.com   1
1  minsu  ms@gmail.com   2

In [232]:
df.loc[2] = {"Email":"data@gmail.com", "Name":"data", "id":3}
df

    Name           Email  id
0  doori    dr@gmail.com   1
1  minsu    ms@gmail.com   2
2   data  data@gmail.com   3

In [233]:
df.loc[1]

Name            minsu
Email    ms@gmail.com
id                  2
Name: 1, dtype: object

In [234]:
df.loc[0]

Name            doori
Email    dr@gmail.com
id                  1
Name: 0, dtype: object

#### 2.1.3 인덱스를 수정하는 방법

In [235]:
index_list = ["one", "two"]
df = pd.DataFrame(dic, index=index_list)
print(df)

      Name         Email  id
one  doori  dr@gmail.com   1
two  minsu  ms@gmail.com   2

인덱스, 컬럼, 값을 리스트로 가져올수 있습니다.

In [236]:
print(df.index)
print(df.columns)
print(df.values)

Index(['one', 'two'], dtype='object')
Index(['Name', 'Email', 'id'], dtype='object')
[['doori' 'dr@gmail.com' 1]
 ['minsu' 'ms@gmail.com' 2]]

In [237]:
df.dtypes

Name     object
Email    object
id        int64
dtype: object

---

#### 연습문제: Dataframe 만들기

인덱스가 ['1번', '2번'] 이고 열 제목은 '비밀번호', 열 내용은 ['1q2w', 'qwer!!']인 단일 열로 이루어진 Dataframe을 만들어 보세요.

In [469]:
index_list = ['1번', '2번']
data = pd.DataFrame(['1q2w', 'qwer!!'], columns=['비밀번호'], index=index_list)
# data[____] = ____
data

      비밀번호
1번    1q2w
2번  qwer!!

In [470]:
# ctrl+shift+- 셀쪼개기
# shift+m 셀합치기

---

### 2.2 Insert
- row
- column

#### 2.2.1 row
- `loc`를 이용하여 row를 선택하거나 수정이 가능합니다.

In [240]:
df

      Name         Email  id
one  doori  dr@gmail.com   1
two  minsu  ms@gmail.com   2

In [241]:
name = ["doori", "minsu"]
email = ["dr@gmail.com", "ms@gmail.com"]
ids = [1, 2]
dic = {"Name":name, "Email":email, "id": ids}
df = pd.DataFrame(dic)
print(df.loc[1])
print()
df.loc[2] = {"Email":"data@gmail.com", "Name":"data", "id":3}
print(df)

Name            minsu
Email    ms@gmail.com
id                  2
Name: 1, dtype: object

    Name           Email  id
0  doori    dr@gmail.com   1
1  minsu    ms@gmail.com   2
2   data  data@gmail.com   3

In [242]:
data = pd.DataFrame(columns=['Name', 'Email', 'id'], index=['one', 'two', 'three'], data=df.values)

In [243]:
data

        Name           Email id
one    doori    dr@gmail.com  1
two    minsu    ms@gmail.com  2
three   data  data@gmail.com  3

loc를 이용하여 row를 선택

In [244]:
df.loc[1]

Name            minsu
Email    ms@gmail.com
id                  2
Name: 1, dtype: object

loc 이용해서 항상 가장 마지막에 넣는 방법

In [245]:
print(len(df))
df.loc[len(df)] = {"Email":"data2@gmail.com", "Name":"data2", "id":4}
df

3

    Name            Email  id
0  doori     dr@gmail.com   1
1  minsu     ms@gmail.com   2
2   data   data@gmail.com   3
3  data2  data2@gmail.com   4

범위를 지정해서 row를 선택

In [246]:
print(df.loc[1:3])

    Name            Email  id
1  minsu     ms@gmail.com   2
2   data   data@gmail.com   3
3  data2  data2@gmail.com   4

loc[rows, columns] 를 이용하여 row와 columns를 지정하여 데이터 출력

In [247]:
print(df.loc[1:3, ["Email", "id"]])

             Email  id
1     ms@gmail.com   2
2   data@gmail.com   3
3  data2@gmail.com   4

특정 row를 지정해서 가져올수 있습니다.

In [248]:
print(df.loc[[1,3], ["Email","Name"]])

             Email   Name
1     ms@gmail.com  minsu
3  data2@gmail.com  data2

In [249]:
df

    Name            Email  id
0  doori     dr@gmail.com   1
1  minsu     ms@gmail.com   2
2   data   data@gmail.com   3
3  data2  data2@gmail.com   4

#### 2.2.2 column
- `["컬럼명"]`을 이용하여 column을 추가할수 있습니다.

브로드 캐스팅으로 공백 문자가 들어갑니다.

In [250]:
df["Address"] = ""
print(df)

    Name            Email  id Address
0  doori     dr@gmail.com   1
1  minsu     ms@gmail.com   2
2   data   data@gmail.com   3
3  data2  data2@gmail.com   4

- 리스트를 대입해주면 리스트의 데이터가 들어갑니다.
- 데이터 프레임의 row수와 리스트의 갯수가 맞지 않으면 에러가 발생합니다.

In [251]:
df = df.loc[:3]

In [252]:
df["Address"] = ["Seoul", "Busan", "Jeju", "Deagu"]
print(df)

    Name            Email  id Address
0  doori     dr@gmail.com   1   Seoul
1  minsu     ms@gmail.com   2   Busan
2   data   data@gmail.com   3    Jeju
3  data2  data2@gmail.com   4   Deagu

In [253]:
df["Address"]

0    Seoul
1    Busan
2     Jeju
3    Deagu
Name: Address, dtype: object

In [254]:
df[["Address"]]  # dataframe 형태

  Address
0   Seoul
1   Busan
2    Jeju
3   Deagu

In [255]:
type(df["Address"])

pandas.core.series.Series

In [256]:
type(df[["Address"]])

pandas.core.frame.DataFrame

In [257]:
df[["Address", "Email"]]

  Address            Email
0   Seoul     dr@gmail.com
1   Busan     ms@gmail.com
2    Jeju   data@gmail.com
3   Deagu  data2@gmail.com

In [258]:
df

    Name            Email  id Address
0  doori     dr@gmail.com   1   Seoul
1  minsu     ms@gmail.com   2   Busan
2   data   data@gmail.com   3    Jeju
3  data2  data2@gmail.com   4   Deagu

In [259]:
df

    Name            Email  id Address
0  doori     dr@gmail.com   1   Seoul
1  minsu     ms@gmail.com   2   Busan
2   data   data@gmail.com   3    Jeju
3  data2  data2@gmail.com   4   Deagu

In [260]:
len(df)

4

---

아래와 같이 정의된 df2에 Name은 sora, Email은 sora23@gmail.com, id는 5, Address는 Incheon 으로 된 행을 하나 추가해 보세요.

In [261]:
import copy  # 얕은 복사(메모리 공유) vs 깊은 복사(완전히 새롭게 다른 곳에 저장) → deepcopy
df2 = copy.deepcopy(df)  # 깊은 복사다!

In [262]:
df2.loc[len(df)] = {"Name":"sora", "Email":"sora23@gmail.com", "id":5, "Address":"Incheon"}
# df2.loc[len(df)] = ["sora", "sora23@gmail.com", 5, "Incheon"]  # 리스트로 담아도 된다
df2

    Name             Email  id  Address
0  doori      dr@gmail.com   1    Seoul
1  minsu      ms@gmail.com   2    Busan
2   data    data@gmail.com   3     Jeju
3  data2   data2@gmail.com   4    Deagu
4   sora  sora23@gmail.com   5  Incheon

---

### 2.3 apply
- 함수를 사용해서 함수의 리턴값으로 Series를 만들어 새로운 컬럼을 생성할수 있습니다.
- 연산 함수

In [263]:
df

    Name            Email  id Address
0  doori     dr@gmail.com   1   Seoul
1  minsu     ms@gmail.com   2   Busan
2   data   data@gmail.com   3    Jeju
3  data2  data2@gmail.com   4   Deagu

##### 함수

In [264]:
def myfunc(x):
    output = x + 5
    return output

In [265]:
myfunc(2)

7

In [266]:
(lambda x: x+5)(2)

7

In [267]:
df['Name']  # Seires 형태이다

0    doori
1    minsu
2     data
3    data2
Name: Name, dtype: object

In [268]:
'doori'[:3]

'doo'

In [269]:
df['Name'].apply(lambda x: print(x))  # Series 각각 값들에 대해서 각각 이 함수에 넣어 실행하라

doori
minsu
data
data2

0    None
1    None
2    None
3    None
Name: Name, dtype: object

In [270]:
df['Name'].apply(lambda x: x[:3])

0    doo
1    min
2    dat
3    dat
Name: Name, dtype: object

In [271]:
df['Name'].apply(lambda x: len(x))

0    5
1    5
2    4
3    5
Name: Name, dtype: int64

In [272]:
df['Name'].apply(len)  # len은 이미 정의되어 있는 함수이기 때문에 lambda 안 써도 가능

0    5
1    5
2    4
3    5
Name: Name, dtype: int64

In [273]:
df['Name']  # Series 값들

0    doori
1    minsu
2     data
3    data2
Name: Name, dtype: object

In [274]:
def count_char(name):
    return "{}({})".format(name, len(name))  # format을 이용한 출력 방법

df["Name_Count"] = df["Name"].apply(count_char)
df

    Name            Email  id Address Name_Count
0  doori     dr@gmail.com   1   Seoul   doori(5)
1  minsu     ms@gmail.com   2   Busan   minsu(5)
2   data   data@gmail.com   3    Jeju    data(4)
3  data2  data2@gmail.com   4   Deagu   data2(5)

람다 함수를 사용

In [275]:
df["Address_Count"] = df["Address"].apply(lambda addr:"{}({})".format(addr, len(addr)))
df

    Name            Email  id Address Name_Count Address_Count
0  doori     dr@gmail.com   1   Seoul   doori(5)      Seoul(5)
1  minsu     ms@gmail.com   2   Busan   minsu(5)      Busan(5)
2   data   data@gmail.com   3    Jeju    data(4)       Jeju(4)
3  data2  data2@gmail.com   4   Deagu   data2(5)      Deagu(5)

### 2.4 append
- 데이터 프레임을 합치고 싶을때 append를 이용하여 데이터 프레임을 합칠수 있습니다.

In [276]:
# 사람의 이름과 나이가 들어간 데이터를 만듭니다.
import random

# 랜던한 이름 출력하는 함수
def get_name():
    names = ["Adam", "Alan", "Alex", "Alvin", "Andrew", "Anthony", "Arnold", "Jin", "Billy", "Anchal"]
    return random.choice(names)
    
get_name()

'Andrew'

In [277]:
# 랜덤한 나이 출력
def get_age(start=20, end=40):
    return np.random.randint(start, end + 1)

get_age()

37

In [278]:
mylist = []
mylist.append(9)
mylist.append(8)
mylist

[9, 8]

In [279]:
# 랜덤하게 나이와 이름을 출력
def make_data(rows=10):
    datas = []
    for _ in range(rows):
        data = {"Age":get_age(), "Name":get_name()}
        datas.append(data)
    return datas

make_data()

[{'Age': 29, 'Name': 'Adam'},
 {'Age': 20, 'Name': 'Jin'},
 {'Age': 22, 'Name': 'Billy'},
 {'Age': 20, 'Name': 'Alvin'},
 {'Age': 29, 'Name': 'Anthony'},
 {'Age': 32, 'Name': 'Alex'},
 {'Age': 32, 'Name': 'Andrew'},
 {'Age': 23, 'Name': 'Andrew'},
 {'Age': 28, 'Name': 'Anthony'},
 {'Age': 27, 'Name': 'Adam'}]

두개의 데이터 프레임을 만듦

In [326]:
name1 = ["Adam", "Alvin", "Andrew"]
age1 = [23,32,33]
name2 = ["Anthony", "Arnold", "Jin"]
age2 = [25,34,31]
dic1 = {"Age":age1, "Name":name1}
dic2 = {"Age":age2, "Name":name2}
df1 = pd.DataFrame(dic1)
print(df1)
df2 = pd.DataFrame(dic2)
print(df2)

   Age    Name
0   23    Adam
1   32   Alvin
2   33  Andrew
   Age     Name
0   25  Anthony
1   34   Arnold
2   31      Jin

In [327]:
df3 = df1.append(df2)
print(df3)

   Age     Name
0   23     Adam
1   32    Alvin
2   33   Andrew
0   25  Anthony
1   34   Arnold
2   31      Jin

C:\Users\king5\AppData\Local\Temp\ipykernel_15136\2858898568.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2)

In [328]:
data1 = make_data(5)
df1 = pd.DataFrame(data1)
df1

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex

In [329]:
data2 = make_data(5)
df2 = pd.DataFrame(data2)
df2

   Age     Name
0   30     Adam
1   36   Anchal
2   23     Adam
3   34     Alan
4   40  Anthony

df1과 df2를 합치고 싶을때 append를 이용할수 있습니다.

In [330]:
df3 = df1.append(df2)
df3

C:\Users\king5\AppData\Local\Temp\ipykernel_15136\3362903225.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2)

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
0   30     Adam
1   36   Anchal
2   23     Adam
3   34     Alan
4   40  Anthony

index 리셋하기
- drop(True) - 새롭게 생성되는 인덱스 컬럼을 삭제합니다.
- inplace(True) - 함수를 사용하는 객체 자체 인덱스를 리셋합니다.

In [331]:
df3.reset_index()  # reset index하고 불필요한건 지움

   index  Age     Name
0      0   32   Arnold
1      1   34  Anthony
2      2   25   Andrew
3      3   33    Alvin
4      4   29     Alex
5      0   30     Adam
6      1   36   Anchal
7      2   23     Adam
8      3   34     Alan
9      4   40  Anthony

In [332]:
df3.reset_index(drop=True)

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
5   30     Adam
6   36   Anchal
7   23     Adam
8   34     Alan
9   40  Anthony

In [333]:
df3

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
0   30     Adam
1   36   Anchal
2   23     Adam
3   34     Alan
4   40  Anthony

In [334]:
df3.reset_index(drop=True, inplace=True)  # df3를 따로 넣어주지 않았기 때문에 바뀌지 않았지만, inplace=True면 그 자체가 바뀜
print(df3)

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
5   30     Adam
6   36   Anchal
7   23     Adam
8   34     Alan
9   40  Anthony

append를 할때 인덱스를 리셋할수 있습니다.

In [335]:
df3 = df1.append(df2, ignore_index=True)  # 처음부터 인덱스를 무시하고 append 할 수도 있다
df = df3
score = ['']
df3

C:\Users\king5\AppData\Local\Temp\ipykernel_15136\2516351750.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2, ignore_index=True)  # 처음부터 인덱스를 무시하고 append 할 수도 있다

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
5   30     Adam
6   36   Anchal
7   23     Adam
8   34     Alan
9   40  Anthony

In [336]:
df = df3
score = [85,86,78,99,90,66,88,69,92,78]
df['Score']=score
df

   Age     Name  Score
0   32   Arnold     85
1   34  Anthony     86
2   25   Andrew     78
3   33    Alvin     99
4   29     Alex     90
5   30     Adam     66
6   36   Anchal     88
7   23     Adam     69
8   34     Alan     92
9   40  Anthony     78

In [337]:
names = ['apple','pear','apple','banana', 'pear']
quantity = [3,5,1,2,2]
g_df = pd.DataFrame({'Name':names, 'Quantity':quantity})
print(g_df)

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [338]:
g_df['Quantity']

0    3
1    5
2    1
3    2
4    2
Name: Quantity, dtype: int64

In [339]:
g_df.Quantity

0    3
1    5
2    1
3    2
4    2
Name: Quantity, dtype: int64

In [340]:
print(g_df.Quantity.sum())
print(g_df.Quantity.mean())
print(g_df.Quantity.var())
print(g_df.Quantity.std())

13
2.6
2.3
1.51657508881031

In [341]:
print(g_df.Quantity.min())
print(g_df.Quantity.max())
print(g_df.Quantity.argmin())  # 최소값에 해당하는 인덱스 값 출력
print(g_df.Quantity.argmax())  # 최대값에 해당하는 인덱스 값 출력

1
5
2
1

In [342]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [343]:
print(g_df.sort_values('Quantity'))
print(g_df.sort_values('Name', ascending=False))  # dataframe 재배열

     Name  Quantity
2   apple         1
3  banana         2
4    pear         2
0   apple         3
1    pear         5
     Name  Quantity
1    pear         5
4    pear         2
3  banana         2
0   apple         3
2   apple         1

In [344]:
print(g_df.Quantity.rank())
g_df['Rank'] = g_df.Quantity.rank()
print(g_df)

0    4.0
1    5.0
2    1.0
3    2.5
4    2.5
Name: Quantity, dtype: float64
     Name  Quantity  Rank
0   apple         3   4.0
1    pear         5   5.0
2   apple         1   1.0
3  banana         2   2.5
4    pear         2   2.5

In [345]:
print(g_df['Quantity'].value_counts())

2    2
3    1
5    1
1    1
Name: Quantity, dtype: int64

In [346]:
print(g_df['Quantity'].count())

5

In [347]:
print(g_df.count()) # Nan값을 제외한 데이터수 확인

Name        5
Quantity    5
Rank        5
dtype: int64

In [348]:
g_df

     Name  Quantity  Rank
0   apple         3   4.0
1    pear         5   5.0
2   apple         1   1.0
3  banana         2   2.5
4    pear         2   2.5

In [349]:
type(g_df['Name'])  # Series

pandas.core.series.Series

In [350]:
if 'apple' in list(g_df['Name']):
  print("True")

True

### 2.5 concat
- row나 column으로 데이터를 합치는 pandas 함수 입니다.

concat rows

In [351]:
df1

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex

In [352]:
df2

   Age     Name
0   30     Adam
1   36   Anchal
2   23     Adam
3   34     Alan
4   40  Anthony

concat함수의 파라미터로 axis=0 으로 설정하면 세로로 합쳐 집니다. (default axis=0)

In [353]:
df2

   Age     Name
0   30     Adam
1   36   Anchal
2   23     Adam
3   34     Alan
4   40  Anthony

In [354]:
df3 = pd.concat([df1, df2]).reset_index(drop=True)
print(df3)

   Age     Name
0   32   Arnold
1   34  Anthony
2   25   Andrew
3   33    Alvin
4   29     Alex
5   30     Adam
6   36   Anchal
7   23     Adam
8   34     Alan
9   40  Anthony

concat함수의 파라미터로 axis=1 으로 설정하면 가로로 합쳐 집니다. (default axis=1)

In [355]:
df4 = pd.concat([df1, df2], axis=1)
df4

   Age     Name  Age     Name
0   32   Arnold   30     Adam
1   34  Anthony   36   Anchal
2   25   Andrew   23     Adam
3   33    Alvin   34     Alan
4   29     Alex   40  Anthony

join의 기본은 outer이고 inner로 설정하면 NaN 데이터가 없는 공통된 부분만 합쳐집니다.

In [356]:
df4 = pd.concat([df1, df3], axis=1, join='inner')
df4

   Age     Name  Age     Name
0   32   Arnold   32   Arnold
1   34  Anthony   34  Anthony
2   25   Andrew   25   Andrew
3   33    Alvin   33    Alvin
4   29     Alex   29     Alex

In [357]:
df4 = pd.concat([df1, df3], axis=1, join='outer')
df4

    Age     Name  Age     Name
0  32.0   Arnold   32   Arnold
1  34.0  Anthony   34  Anthony
2  25.0   Andrew   25   Andrew
3  33.0    Alvin   33    Alvin
4  29.0     Alex   29     Alex
5   NaN      NaN   30     Adam
6   NaN      NaN   36   Anchal
7   NaN      NaN   23     Adam
8   NaN      NaN   34     Alan
9   NaN      NaN   40  Anthony

In [358]:
df0 = pd.DataFrame({"Name":['a','b','c']})
df0

  Name
0    a
1    b
2    c

In [359]:
df0['Age'] = [31, 40, np.nan]

In [360]:
df0

  Name   Age
0    a  31.0
1    b  40.0
2    c   NaN

### 2.6 Group by
- 특정 컬럼의 중복되는 row를 합쳐 새로운 데이터 프레임을 만드는 방법입니다.
- 이름별 평균 나이를 나타내는 데이터 프레임을 만듭니다.


1. size
1. sort_values
1. agg

10명에 대한 이름과 나이를 나타내는 데이터 프레임을 만듭니다.

In [128]:
names = ['apple','pear','apple','banana', 'pear']
quantity = [3,5,1,2,2]
g_df = pd.DataFrame({'Name':names, 'Quantity':quantity})
print(g_df)

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [129]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

#### groupby - size
- groupby를 할 설정된 컬럼으로 공통된 row 데이터가 합쳐지고 합쳐진 row의 갯수를 출력합니다.
- g_df.groupby("Name").size()결과로 나온 Series 데이터가 reset_index(name="counts") 함수를 수행하여 counts라는 컬럼으로 추가 됩니다.

In [130]:
print(g_df.groupby("Name").size())  # group으로 묶고, 그 이후 size (몇 번 반복했나) 계산값 출력

Name
apple     2
banana    1
pear      2
dtype: int64

In [132]:
result_df = g_df.groupby("Name").size().reset_index(name="counts")
# reset_index는 drop하지 않으면 기본적으로 칼럼으로 가는데 원래 시리즈 칼럼명을 생성해준다???
print(result_df)

     Name  counts
0   apple       2
1  banana       1
2    pear       2

#### sort values
- 설정한 컬럼으로 오름차순이나 내림차순으로 정렬하는 함수 입니다.

In [133]:
result_df = result_df.sort_values(by=["counts"], ascending=False)  # 내림차순
result_df.reset_index(drop=True, inplace=True)
print(result_df)

     Name  counts
0   apple       2
1    pear       2
2  banana       1

#### agg : min

Name으로 그룹핑하고 그룹핑된 데이터에서 최소값 Age를 출력

In [136]:
g_df.groupby('Name').apply(lambda x: print(x))  # 묶인걸 lambda를 통해 시각적으로 확인 할 수 있다

    Name  Quantity
0  apple         3
2  apple         1
     Name  Quantity
3  banana         2
   Name  Quantity
1  pear         5
4  pear         2

Empty DataFrame
Columns: []
Index: []

In [137]:
print(g_df.groupby("Name").agg("min").reset_index())  # 각각 묶인 것 중에 수량에 대한 min 값을 출력

     Name  Quantity
0   apple         1
1  banana         2
2    pear         2

#### agg : max

Name으로 그룹핑하고 그룹핑된 데이터에서 최대값 Age를 출력

In [138]:
print(g_df.groupby("Name").agg("max").reset_index())

     Name  Quantity
0   apple         3
1  banana         2
2    pear         5

#### agg : mean

Name으로 그룹핑하고 그룹핑된 데이터에서 평균값 Age를 출력

In [139]:
print(g_df.groupby("Name").agg("mean").reset_index())

     Name  Quantity
0   apple       2.0
1  banana       2.0
2    pear       3.5

#### agg : sum

In [140]:
print(g_df.groupby("Name").agg("sum").reset_index())

     Name  Quantity
0   apple         4
1  banana         2
2    pear         7

#### agg : median

Name으로 그룹핑하고 그룹핑된 데이터에서 중간값 Age를 출력

In [141]:
g_df.groupby("Name").agg("median").reset_index()

     Name  Quantity
0   apple       2.0
1  banana       2.0
2    pear       3.5

In [142]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [146]:
g_df.groupby('Name').agg([min, max, np.mean, 'median', sum])  # 내부에 있는 함수는 그냥 쓰고, 없는 건 np. 쓰거나, ''로 묶어줘

       Quantity
            min max mean median sum
Name
apple         1   3  2.0    2.0   4
banana        2   2  2.0    2.0   2
pear          2   5  3.5    3.5   7

In [147]:
result_df = g_df.groupby("Name").sum()
print(result_df)

        Quantity
Name
apple          4
banana         2
pear           7

---

위의 DataFrame g_df에서 banana 개수의 합을 groupby를 이용해 출력해 보세요.

In [148]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [163]:
g_df.groupby('Name').agg(sum)

        Quantity
Name
apple          4
banana         2
pear           7

In [165]:
result_df = g_df.groupby('Name').agg('sum')
# result_df = g_df.groupby('Name').sum()  # sum은 내장되어 있어서 바로 써도 된다
result_df['Quantity']['banana']  # column으로 먼저 뽑고 네임 접근

2

In [167]:
result_df.loc['banana']  # index에 대해서는 loc로 접근해야함

Quantity    2
Name: banana, dtype: int64

In [168]:
result_df.loc['banana']['Quantity']

2

In [183]:
result_df

        Quantity
Name
apple          4
banana         2
pear           7

In [184]:
result_df.reset_index()

     Name  Quantity
0   apple         4
1  banana         2
2    pear         7

In [185]:
rdf = result_df.reset_index()
rdf

     Name  Quantity
0   apple         4
1  banana         2
2    pear         7

In [186]:
rdf.loc[rdf['Name']=='banana']  # boolean으로 접근

     Name  Quantity
1  banana         2

In [187]:
rdf.loc[rdf['Name']=='banana']['Quantity']

1    2
Name: Quantity, dtype: int64

In [191]:
rdf.loc[rdf['Name']=='banana']['Quantity'].values

array([2], dtype=int64)

In [195]:
rdf.loc[rdf['Name']=='banana']['Quantity'].values[0]

2

---

agg으로 여러개 컬럼 생성
- Name으로 그룹핑하고 그룹핑된 데이터에서 최소 최대 평균값을 Age 컬럼에 출력

In [169]:
df_agg = g_df.groupby("Name").agg(["min","max","mean"]).reset_index()
print(df_agg)

     Name Quantity
               min max mean
0   apple        1   3  2.0
1  banana        2   2  2.0
2    pear        2   5  3.5

### 2.7 select

In [170]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [171]:
print(g_df.head(2))
print(g_df.tail(3))

    Name  Quantity
0  apple         3
1   pear         5
     Name  Quantity
2   apple         1
3  banana         2
4    pear         2

In [172]:
g_df.head(2)

    Name  Quantity
0  apple         3
1   pear         5

In [173]:
g_df.tail(3)

     Name  Quantity
2   apple         1
3  banana         2
4    pear         2

In [174]:
g_df.tail()

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

offset index를 이용하여 원하는 데이터를 선택적으로 출력이 가능

In [175]:
print(g_df[1:3])

    Name  Quantity
1   pear         5
2  apple         1

In [176]:
g_df[3:]

     Name  Quantity
3  banana         2
4    pear         2

In [177]:
print(g_df.loc[2:])

     Name  Quantity
2   apple         1
3  banana         2
4    pear         2

describe 함수를 이용하여 데이터를 요약해서 보여줌

In [178]:
print(g_df.describe())

       Quantity
count  5.000000
mean   2.600000
std    1.516575
min    1.000000
25%    2.000000
50%    2.000000
75%    3.000000
max    5.000000

### 2.8 Merge = sql(join)
- 두개 이상의 데이터 프레임을 합쳐서 합쳐진 데이터를 출력하는 방법
- 아래와 같이 이름과 주소 데이터가 있는 데이터 프레임과 이름과 인구가 있는 데이터 프레임을 합쳐서 이름과 주소와 인구가 있는 데이터 프레임을 만드는 방법

---

<center>이름과 주소</center>

|Name|Addr|
|---|---|
|A|Seoul|
|B|Pusan|
|C|Incheon|

---

<center>이름과 인구</center>

|Name|Population|
|---|---|
|A|1000|
|B|300|
|C|200|

---

<center>이름과 주소와 인구</center>

|Name|Addr|Population|
|---|---|---|
|A|Seoul|1000|
|B|Pusan|300|
|C|Incheon|200|

- user_df : 아이디, 이름, 나이 데이터 프레임 생성

In [179]:
user_df = pd.DataFrame(columns=["UserID", "Name", "Age"])
for idx in range(1,9):
    name = get_name()
    
    # 중복 이름 제거
    while name in list(user_df["Name"]):
        name = get_name()
        
    # 데이터 name_df insert
    data = {"Name":name, "UserID":idx, "Age":get_age()}
    user_df.loc[len(user_df)] = data
    
user_df

   UserID     Name  Age
0       1     Alex   39
1       2     Adam   34
2       3   Arnold   21
3       4    Billy   35
4       5  Anthony   23
5       6     Alan   36
6       7   Andrew   40
7       8    Alvin   20

- money_df : 아이디, 돈 데이터 프레임 생성

In [180]:
money_df = pd.DataFrame(columns=["ID", "Money"])

for idx in range(15):
    money = np.random.randint(1, 21) * 1000
    data = {"Money":money, "ID":random.randint(1, 8)}
    money_df.loc[len(money_df)] = data
    
money_df

    ID  Money
0    6  15000
1    7  17000
2    7  11000
3    5   8000
4    3  19000
5    6  19000
6    1  14000
7    7   1000
8    1   3000
9    4  10000
10   8  11000
11   3  11000
12   5   7000
13   6   1000
14   5  11000

In [181]:
money_df['ID'].unique()

array([6, 7, 5, 3, 1, 4, 8], dtype=int64)

In [182]:
ids = money_df["ID"].unique()
ids.sort()
ids

array([1, 3, 4, 5, 6, 7, 8], dtype=int64)

#### merge - inner
- user_df, money_df 
- key:ID, UserID
- money_df 데이터 기준으로 merge

In [196]:
money_df.merge(user_df, left_on="ID", right_on="UserID")

    ID  Money  UserID     Name  Age
0    6  15000       6     Alan   36
1    6  19000       6     Alan   36
2    6   1000       6     Alan   36
3    7  17000       7   Andrew   40
4    7  11000       7   Andrew   40
5    7   1000       7   Andrew   40
6    5   8000       5  Anthony   23
7    5   7000       5  Anthony   23
8    5  11000       5  Anthony   23
9    3  19000       3   Arnold   21
10   3  11000       3   Arnold   21
11   1  14000       1     Alex   39
12   1   3000       1     Alex   39
13   4  10000       4    Billy   35
14   8  11000       8    Alvin   20

user_df 데이터 기준으로 merge

In [197]:
user_df.merge(money_df, left_on="UserID", right_on="ID")

    UserID     Name  Age  ID  Money
0        1     Alex   39   1  14000
1        1     Alex   39   1   3000
2        3   Arnold   21   3  19000
3        3   Arnold   21   3  11000
4        4    Billy   35   4  10000
5        5  Anthony   23   5   8000
6        5  Anthony   23   5   7000
7        5  Anthony   23   5  11000
8        6     Alan   36   6  15000
9        6     Alan   36   6  19000
10       6     Alan   36   6   1000
11       7   Andrew   40   7  17000
12       7   Andrew   40   7  11000
13       7   Andrew   40   7   1000
14       8    Alvin   20   8  11000

user_df의 컬럼명 UserID를 ID로 변경

In [198]:
user_df.rename(columns={"UserID":"ID"}, inplace=True)  # dictionary로!
user_df

   ID     Name  Age
0   1     Alex   39
1   2     Adam   34
2   3   Arnold   21
3   4    Billy   35
4   5  Anthony   23
5   6     Alan   36
6   7   Andrew   40
7   8    Alvin   20

키값으로 사용할 컬럼명이 같으면 left_on과 right_on을 설정할 필요가 없다.

In [199]:
result_df = pd.merge(money_df, user_df)
result_df

    ID  Money     Name  Age
0    6  15000     Alan   36
1    6  19000     Alan   36
2    6   1000     Alan   36
3    7  17000   Andrew   40
4    7  11000   Andrew   40
5    7   1000   Andrew   40
6    5   8000  Anthony   23
7    5   7000  Anthony   23
8    5  11000  Anthony   23
9    3  19000   Arnold   21
10   3  11000   Arnold   21
11   1  14000     Alex   39
12   1   3000     Alex   39
13   4  10000    Billy   35
14   8  11000    Alvin   20

In [203]:
result_df.groupby('Name').sum()  # 이름별로 묶어서 다 더했다. 이 자체가 데이터프레임이다

         ID  Money  Age
Name
Alan     18  35000  108
Alex      2  17000   78
Alvin     8  11000   20
Andrew   21  29000  120
Anthony  15  26000   69
Arnold    6  30000   42
Billy     4  10000   35

In [204]:
result_df.groupby('Name').sum()['Money']  # Series 형태가 된다

Name
Alan       35000
Alex       17000
Alvin      11000
Andrew     29000
Anthony    26000
Arnold     30000
Billy      10000
Name: Money, dtype: int64

In [205]:
result_df.groupby('Name').sum()['Money'].reset_index()

      Name  Money
0     Alan  35000
1     Alex  17000
2    Alvin  11000
3   Andrew  29000
4  Anthony  26000
5   Arnold  30000
6    Billy  10000

Name으로 Groupby하고 Money 데이터를 합친 사람별 전체 돈을 합친 결과 데이터 프레임

In [206]:
money_list = result_df.groupby("Name").sum()["Money"].reset_index()
money_list

      Name  Money
0     Alan  35000
1     Alex  17000
2    Alvin  11000
3   Andrew  29000
4  Anthony  26000
5   Arnold  30000
6    Billy  10000

In [213]:
money_list = result_df.groupby("Name").agg("sum").reset_index()[["Name", "Money"]]
money_list

      Name  Money
0     Alan  35000
1     Alex  17000
2    Alvin  11000
3   Andrew  29000
4  Anthony  26000
5   Arnold  30000
6    Billy  10000

In [215]:
# money_list = result_df.groupby("Name").agg("sum").reset_index()[["Money"]]  # [] : series, [[]] : dataframe
# money_list

#### merge - outer

In [216]:
result = pd.merge(user_df, money_list, how='outer')  # inner : 교집합, outer : 합집합
result  # 따로 지정해주지 않으면 공통 Name으로 합쳐진다 (outer : 없으면 NAN, inner : 없으면 행 사라짐)

   ID     Name  Age    Money
0   1     Alex   39  17000.0
1   2     Adam   34      NaN
2   3   Arnold   21  30000.0
3   4    Billy   35  10000.0
4   5  Anthony   23  26000.0
5   6     Alan   36  35000.0
6   7   Andrew   40  29000.0
7   8    Alvin   20  11000.0

- fillna - NaN을 특정 데이터로 채워줍니다.

In [218]:
result = pd.merge(user_df, money_list, how='outer').fillna(value=0)  # NaN을 0으로 채워주자
result

   ID     Name  Age    Money
0   1     Alex   39  17000.0
1   2     Adam   34      0.0
2   3   Arnold   21  30000.0
3   4    Billy   35  10000.0
4   5  Anthony   23  26000.0
5   6     Alan   36  35000.0
6   7   Andrew   40  29000.0
7   8    Alvin   20  11000.0

특정 컬럼 데이터 타입 변경

In [219]:
result.dtypes

ID         int64
Name      object
Age        int64
Money    float64
dtype: object

Money 컬럼을 float에서 int로 변경

In [221]:
result["Money"] = result["Money"].astype("int")  # astype 내가 원하는 데이터 타입으로 변환
result

   ID     Name  Age  Money
0   1     Alex   39  17000
1   2     Adam   34      0
2   3   Arnold   21  30000
3   4    Billy   35  10000
4   5  Anthony   23  26000
5   6     Alan   36  35000
6   7   Andrew   40  29000
7   8    Alvin   20  11000

In [222]:
result.dtypes

ID        int64
Name     object
Age       int64
Money     int32
dtype: object

### 2.9 기타 기능들

전치(T)
- 행과 열을 바꾼 전치행렬로 출력

In [280]:
print(g_df.T)

              0     1      2       3     4
Name      apple  pear  apple  banana  pear
Quantity      3     5      1       2     2

In [281]:
g_df.transpose()

              0     1      2       3     4
Name      apple  pear  apple  banana  pear
Quantity      3     5      1       2     2

isin
- 자신이 원하는 데이터가 있는 로우를 가져옴

### result

In [282]:
result

   ID     Name  Age  Money
0   1     Alex   39  17000
1   2     Adam   34      0
2   3   Arnold   21  30000
3   4    Billy   35  10000
4   5  Anthony   23  26000
5   6     Alan   36  35000
6   7   Andrew   40  29000
7   8    Alvin   20  11000

In [283]:
result.isin(["Adam", "Alan", 26])  # boolean

      ID   Name    Age  Money
0  False  False  False  False
1  False   True  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False
6  False  False  False  False
7  False  False  False  False

In [284]:
result[result.isin(["Adam", "Alan", 26])]  # Value & NaN

   ID  Name  Age  Money
0 NaN   NaN  NaN    NaN
1 NaN  Adam  NaN    NaN
2 NaN   NaN  NaN    NaN
3 NaN   NaN  NaN    NaN
4 NaN   NaN  NaN    NaN
5 NaN  Alan  NaN    NaN
6 NaN   NaN  NaN    NaN
7 NaN   NaN  NaN    NaN

In [285]:
result[result.isin(["Adam", "Alan", 26])].any(axis=1)

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
dtype: bool

In [286]:
result[result[result.isin(["Adam", "Alan", 26])].any(axis=1)]

   ID  Name  Age  Money
1   2  Adam   34      0
5   6  Alan   36  35000

"Adam", "Alan", 26 데이터가 있는 로우를 출력

In [287]:
result[result[result.isin(["Adam", "Alan", 26])].any(axis=1)]

   ID  Name  Age  Money
1   2  Adam   34      0
5   6  Alan   36  35000

Name 컬럼에 "A"가 포함된 데이터 filtering

In [288]:
g_df

     Name  Quantity
0   apple         3
1    pear         5
2   apple         1
3  banana         2
4    pear         2

In [289]:
g_df["Name"].str.contains("e")

0     True
1     True
2     True
3    False
4     True
Name: Name, dtype: bool

In [290]:
g_df[g_df["Name"].str.contains("e")]

    Name  Quantity
0  apple         3
1   pear         5
2  apple         1
4   pear         2

In [291]:
print(g_df[g_df["Name"].str.contains("e")])

    Name  Quantity
0  apple         3
1   pear         5
2  apple         1
4   pear         2

In [292]:
result[result["Name"].str.contains("A")]

   ID     Name  Age  Money
0   1     Alex   39  17000
1   2     Adam   34      0
2   3   Arnold   21  30000
4   5  Anthony   23  26000
5   6     Alan   36  35000
6   7   Andrew   40  29000
7   8    Alvin   20  11000

In [293]:
# series vs dataframe (type 확인)
# index로 찾을까?(loc) vs boolean으로 찾을까?(조건)

date_range
- 날짜 데이터를 만들어 주는 함수

In [297]:
dates = pd.date_range('20181101', periods=100)
print(dates[:5])
print(dates[-5:])

DatetimeIndex(['2018-11-01', '2018-11-02', '2018-11-03', '2018-11-04',
               '2018-11-05'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-02-04', '2019-02-05', '2019-02-06', '2019-02-07',
               '2019-02-08'],
              dtype='datetime64[ns]', freq='D')

In [303]:
df = pd.DataFrame(np.random.randint(-5, 5), index=dates, columns=list('ABCD'))  # 날짜를 인덱스에 넣고!
df.tail()  # 이렇게 하면 랜덤 숫자 하나만 쭉 반복할 것!

            A  B  C  D
2019-02-04  1  1  1  1
2019-02-05  1  1  1  1
2019-02-06  1  1  1  1
2019-02-07  1  1  1  1
2019-02-08  1  1  1  1

In [305]:
df = pd.DataFrame(np.random.randint(-5, 5, size=(100,4)), index=dates, columns=list('ABCD'))  # 날짜를 인덱스에 넣고!
df.tail()

            A  B  C  D
2019-02-04  2  4  3  3
2019-02-05 -2 -1 -5 -4
2019-02-06 -5 -1  1  3
2019-02-07 -4  1 -4 -4
2019-02-08  3  4 -1 -4

2018년 11월 4일 이후의 데이터를 선택

In [306]:
df[df.index > "20190204"]

            A  B  C  D
2019-02-05 -2 -1 -5 -4
2019-02-06 -5 -1  1  3
2019-02-07 -4  1 -4 -4
2019-02-08  3  4 -1 -4

In [307]:
dates

DatetimeIndex(['2018-11-01', '2018-11-02', '2018-11-03', '2018-11-04',
               '2018-11-05', '2018-11-06', '2018-11-07', '2018-11-08',
               '2018-11-09', '2018-11-10', '2018-11-11', '2018-11-12',
               '2018-11-13', '2018-11-14', '2018-11-15', '2018-11-16',
               '2018-11-17', '2018-11-18', '2018-11-19', '2018-11-20',
               '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-24',
               '2018-11-25', '2018-11-26', '2018-11-27', '2018-11-28',
               '2018-11-29', '2018-11-30', '2018-12-01', '2018-12-02',
               '2018-12-03', '2018-12-04', '2018-12-05', '2018-12-06',
               '2018-12-07', '2018-12-08', '2018-12-09', '2018-12-10',
               '2018-12-11', '2018-12-12', '2018-12-13', '2018-12-14',
               '2018-12-15', '2018-12-16', '2018-12-17', '2018-12-18',
               '2018-12-19', '2018-12-20', '2018-12-21', '2018-12-22',
               '2018-12-23', '2018-12-24', '2018-12-25', '2018-12-26',
               '2018-12-27', '2018-12-28', '2018-12-29', '2018-12-30',
               '2018-12-31', '2019-01-01', '2019-01-02', '2019-01-03',
               '2019-01-04', '2019-01-05', '2019-01-06', '2019-01-07',
               '2019-01-08', '2019-01-09', '2019-01-10', '2019-01-11',
               '2019-01-12', '2019-01-13', '2019-01-14', '2019-01-15',
               '2019-01-16', '2019-01-17', '2019-01-18', '2019-01-19',
               '2019-01-20', '2019-01-21', '2019-01-22', '2019-01-23',
               '2019-01-24', '2019-01-25', '2019-01-26', '2019-01-27',
               '2019-01-28', '2019-01-29', '2019-01-30', '2019-01-31',
               '2019-02-01', '2019-02-02', '2019-02-03', '2019-02-04',
               '2019-02-05', '2019-02-06', '2019-02-07', '2019-02-08'],
              dtype='datetime64[ns]', freq='D')

In [308]:
dates.year

Int64Index([2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2018, 2018, 2018, 2018, 2018, 2019, 2019, 2019, 2019, 2019,
            2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019,
            2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019,
            2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019,
            2019],
           dtype='int64')

In [309]:
dates.month

Int64Index([11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11,
            11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 12, 12, 12, 12,
            12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12,
            12, 12, 12, 12, 12, 12, 12, 12, 12, 12,  1,  1,  1,  1,  1,  1,  1,
             1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
             1,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  2,  2,  2],
           dtype='int64')

In [310]:
dates.day

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
            18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30,  1,  2,  3,  4,
             5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
            22, 23, 24, 25, 26, 27, 28, 29, 30, 31,  1,  2,  3,  4,  5,  6,  7,
             8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24,
            25, 26, 27, 28, 29, 30, 31,  1,  2,  3,  4,  5,  6,  7,  8],
           dtype='int64')

In [315]:
dates.to_period("Y")

PeriodIndex(['2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2018', '2018', '2018',
             '2018', '2018', '2018', '2018', '2018', '2019', '2019', '2019',
             '2019', '2019', '2019', '2019', '2019', '2019', '2019', '2019',
             '2019', '2019', '2019', '2019', '2019', '2019', '2019', '2019',
             '2019', '2019', '2019', '2019', '2019', '2019', '2019', '2019',
             '2019', '2019', '2019', '2019', '2019', '2019', '2019', '2019',
             '2019', '2019', '2019', '2019'],
            dtype='period[A-DEC]')

In [314]:
dates.to_period("M")

PeriodIndex(['2018-11', '2018-11', '2018-11', '2018-11', '2018-11', '2018-11',
             '2018-11', '2018-11', '2018-11', '2018-11', '2018-11', '2018-11',
             '2018-11', '2018-11', '2018-11', '2018-11', '2018-11', '2018-11',
             '2018-11', '2018-11', '2018-11', '2018-11', '2018-11', '2018-11',
             '2018-11', '2018-11', '2018-11', '2018-11', '2018-11', '2018-11',
             '2018-12', '2018-12', '2018-12', '2018-12', '2018-12', '2018-12',
             '2018-12', '2018-12', '2018-12', '2018-12', '2018-12', '2018-12',
             '2018-12', '2018-12', '2018-12', '2018-12', '2018-12', '2018-12',
             '2018-12', '2018-12', '2018-12', '2018-12', '2018-12', '2018-12',
             '2018-12', '2018-12', '2018-12', '2018-12', '2018-12', '2018-12',
             '2018-12', '2019-01', '2019-01', '2019-01', '2019-01', '2019-01',
             '2019-01', '2019-01', '2019-01', '2019-01', '2019-01', '2019-01',
             '2019-01', '2019-01', '2019-01', '2019-01', '2019-01', '2019-01',
             '2019-01', '2019-01', '2019-01', '2019-01', '2019-01', '2019-01',
             '2019-01', '2019-01', '2019-01', '2019-01', '2019-01', '2019-01',
             '2019-01', '2019-01', '2019-02', '2019-02', '2019-02', '2019-02',
             '2019-02', '2019-02', '2019-02', '2019-02'],
            dtype='period[M]')

In [316]:
dates.to_period("D")

PeriodIndex(['2018-11-01', '2018-11-02', '2018-11-03', '2018-11-04',
             '2018-11-05', '2018-11-06', '2018-11-07', '2018-11-08',
             '2018-11-09', '2018-11-10', '2018-11-11', '2018-11-12',
             '2018-11-13', '2018-11-14', '2018-11-15', '2018-11-16',
             '2018-11-17', '2018-11-18', '2018-11-19', '2018-11-20',
             '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-24',
             '2018-11-25', '2018-11-26', '2018-11-27', '2018-11-28',
             '2018-11-29', '2018-11-30', '2018-12-01', '2018-12-02',
             '2018-12-03', '2018-12-04', '2018-12-05', '2018-12-06',
             '2018-12-07', '2018-12-08', '2018-12-09', '2018-12-10',
             '2018-12-11', '2018-12-12', '2018-12-13', '2018-12-14',
             '2018-12-15', '2018-12-16', '2018-12-17', '2018-12-18',
             '2018-12-19', '2018-12-20', '2018-12-21', '2018-12-22',
             '2018-12-23', '2018-12-24', '2018-12-25', '2018-12-26',
             '2018-12-27', '2018-12-28', '2018-12-29', '2018-12-30',
             '2018-12-31', '2019-01-01', '2019-01-02', '2019-01-03',
             '2019-01-04', '2019-01-05', '2019-01-06', '2019-01-07',
             '2019-01-08', '2019-01-09', '2019-01-10', '2019-01-11',
             '2019-01-12', '2019-01-13', '2019-01-14', '2019-01-15',
             '2019-01-16', '2019-01-17', '2019-01-18', '2019-01-19',
             '2019-01-20', '2019-01-21', '2019-01-22', '2019-01-23',
             '2019-01-24', '2019-01-25', '2019-01-26', '2019-01-27',
             '2019-01-28', '2019-01-29', '2019-01-30', '2019-01-31',
             '2019-02-01', '2019-02-02', '2019-02-03', '2019-02-04',
             '2019-02-05', '2019-02-06', '2019-02-07', '2019-02-08'],
            dtype='period[D]')

In [323]:
dates.to_period("h")

PeriodIndex(['2018-11-01 00:00', '2018-11-02 00:00', '2018-11-03 00:00',
             '2018-11-04 00:00', '2018-11-05 00:00', '2018-11-06 00:00',
             '2018-11-07 00:00', '2018-11-08 00:00', '2018-11-09 00:00',
             '2018-11-10 00:00', '2018-11-11 00:00', '2018-11-12 00:00',
             '2018-11-13 00:00', '2018-11-14 00:00', '2018-11-15 00:00',
             '2018-11-16 00:00', '2018-11-17 00:00', '2018-11-18 00:00',
             '2018-11-19 00:00', '2018-11-20 00:00', '2018-11-21 00:00',
             '2018-11-22 00:00', '2018-11-23 00:00', '2018-11-24 00:00',
             '2018-11-25 00:00', '2018-11-26 00:00', '2018-11-27 00:00',
             '2018-11-28 00:00', '2018-11-29 00:00', '2018-11-30 00:00',
             '2018-12-01 00:00', '2018-12-02 00:00', '2018-12-03 00:00',
             '2018-12-04 00:00', '2018-12-05 00:00', '2018-12-06 00:00',
             '2018-12-07 00:00', '2018-12-08 00:00', '2018-12-09 00:00',
             '2018-12-10 00:00', '2018-12-11 00:00', '2018-12-12 00:00',
             '2018-12-13 00:00', '2018-12-14 00:00', '2018-12-15 00:00',
             '2018-12-16 00:00', '2018-12-17 00:00', '2018-12-18 00:00',
             '2018-12-19 00:00', '2018-12-20 00:00', '2018-12-21 00:00',
             '2018-12-22 00:00', '2018-12-23 00:00', '2018-12-24 00:00',
             '2018-12-25 00:00', '2018-12-26 00:00', '2018-12-27 00:00',
             '2018-12-28 00:00', '2018-12-29 00:00', '2018-12-30 00:00',
             '2018-12-31 00:00', '2019-01-01 00:00', '2019-01-02 00:00',
             '2019-01-03 00:00', '2019-01-04 00:00', '2019-01-05 00:00',
             '2019-01-06 00:00', '2019-01-07 00:00', '2019-01-08 00:00',
             '2019-01-09 00:00', '2019-01-10 00:00', '2019-01-11 00:00',
             '2019-01-12 00:00', '2019-01-13 00:00', '2019-01-14 00:00',
             '2019-01-15 00:00', '2019-01-16 00:00', '2019-01-17 00:00',
             '2019-01-18 00:00', '2019-01-19 00:00', '2019-01-20 00:00',
             '2019-01-21 00:00', '2019-01-22 00:00', '2019-01-23 00:00',
             '2019-01-24 00:00', '2019-01-25 00:00', '2019-01-26 00:00',
             '2019-01-27 00:00', '2019-01-28 00:00', '2019-01-29 00:00',
             '2019-01-30 00:00', '2019-01-31 00:00', '2019-02-01 00:00',
             '2019-02-02 00:00', '2019-02-03 00:00', '2019-02-04 00:00',
             '2019-02-05 00:00', '2019-02-06 00:00', '2019-02-07 00:00',
             '2019-02-08 00:00'],
            dtype='period[H]')

년도별 group by

In [324]:
df.groupby(dates.year).agg('mean')

             A         B         C         D
2018 -0.508197 -0.639344  0.147541 -0.114754
2019 -0.923077 -0.333333 -0.820513  0.025641

월별 group by

In [325]:
per = dates.to_period("M")
df.groupby(per).mean()

                A         B         C         D
2018-11 -0.833333 -0.766667  0.433333 -0.433333
2018-12 -0.193548 -0.516129 -0.129032  0.193548
2019-01 -0.967742 -0.548387 -0.870968  0.129032
2019-02 -0.750000  0.500000 -0.625000 -0.375000